app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'pj sheen' LIMIT 1
UPDATE "users" SET "session_token" = '1-106176-47858980-e22fb690e7bdbd', "updated_at" = '2014-11-20 01:47:57.869901' WHERE "users"."id" = 1
INSERT INTO "users" ("created_at", "session_token", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Thu, 20 Nov 2014 01:31:57 UTC +00:00], ["session_token", "1-106176-47858980-cdc524dda282ed"], ["updated_at", Thu, 20 Nov 2014 01:31:57 UTC +00:00], ["username", "pj sheen"]]
---
  def new
    # create client object with app credentials
    client = Soundcloud.new(:client_id => 'f5f27bd7924819d49bd18ce5789e288a',
                            :client_secret => '51a9a1e4bd75af7b101e0fd6c988626e',
                            :redirect_uri => @heroku_redirect)

    # TODO: Add try to make sure that the access token is retrieved successfully
    error = params[:error]
    if error
      flash[:notice] = "Error: #{error}"
    else
      # exchange authorization code for access token
      code = params[:code]
      access_token = client.exchange_token(:code => code)

      # create client object with access token
      client = Soundcloud.new(:access_token => access_token[:access_token])

      # make an authenticated call
      current_user = client.get('/me')

      @user = User.find_by_username(current_user.username)

      params[:user] = {
        :username => current_user.username,
        :session_token => access_token[:access_token],
      }

      if @user
        @user.session_token = params[:user][:session_token]
        @user.save!
      else
        User.create!(params[:user])